In [1]:
import pandas as pd
import numpy as np
from datetime import datetime

In [2]:
#Load the dataset
df = pd.read_csv('final_book_dataset_kaggle2.csv')
df.head()

,title,author,price,price (including used books),pages,avg_reviews,n_reviews,star5,star4,star3,star2,star1,dimensions,weight,language,publisher,ISBN_13,link,complete_link
0,Data Analysis Using R (Low Priced Edition): A ...,[ Dr Dhaval Maheta],6.75,6.75,500,4.4,23,55%,39%,6%,NaN,NaN,8.5 x 1.01 x 11 inches,2.53 pounds,English,"Notion Press Media Pvt Ltd (November 22, 2021)",978-1685549596,/Data-Analysis-Using-Low-Priced/dp/1685549594/...,https://www.amazon.com/Data-Analysis-Using-Low...
1,Head First Data Analysis: A learner's guide to...,NaN,33.72,21.49 - 33.72,484,4.3,124,61%,20%,9%,4%,6%,8 x 0.98 x 9.25 inches,1.96 pounds,English,"O'Reilly Media; 1st edition (August 18, 2009)",978-0596153939,/Head-First-Data-Analysis-statistics/dp/059615...,https://www.amazon.com/Head-First-Data-Analysi...
2,Guerrilla Data Analysis Using Microsoft Excel:...,"[ Oz du Soleil, and , Bill Jelen]",32.07,32.07,274,4.7,10,87%,13%,NaN,NaN,NaN,8.25 x 0.6 x 10.75 inches,1.4 pounds,English,"Holy Macro! Books; Third edition (August 1, 2022)",978-1615470747,/Guerrilla-Analysis-Using-Microsoft-Excel/dp/1...,https://www.amazon.com/Guerrilla-Analysis-Usin...
3,Python for Data Analysis: Data Wrangling with ...,[ William McKinney],53.99,53.99,547,4.6,"1,686",75%,16%,5%,2%,2%,7 x 1.11 x 9.19 inches,1.47 pounds,English,"O'Reilly Media; 2nd edition (November 14, 2017)",978-1491957660,/Python-Data-Analysis-Wrangling-IPython/dp/149...,https://www.amazon.com/Python-Data-Analysis-Wr...
4,Excel Data Analysis For Dummies (For Dummies (...,[ Paul McFedries],24.49,24.49,368,3.9,12,52%,17%,10%,10%,10%,7.38 x 0.83 x 9.25 inches,1.3 pounds,English,"For Dummies; 5th edition (February 3, 2022)",978-1119844426,/Excel-Data-Analysis-Dummies-Computer/dp/11198...,https://www.amazon.com/Excel-Data-Analysis-Dum...

### Checking basic info

In [3]:
df.columns

Index(['title', 'author', 'price', 'price (including used books)', 'pages',
       'avg_reviews', 'n_reviews', 'star5', 'star4', 'star3', 'star2', 'star1',
       'dimensions', 'weight', 'language', 'publisher', 'ISBN_13', 'link',
       'complete_link'],
      dtype='object')

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 830 entries, 0 to 829
Data columns (total 19 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   title                         830 non-null    object
 1   author                        657 non-null    object
 2   price                         722 non-null    float64
 3   price (including used books)  722 non-null    object
 4   pages                         745 non-null    object
 5   avg_reviews                   702 non-null    float64
 6   n_reviews                     702 non-null    object
 7   star5                         702 non-null    object
 8   star4                         635 non-null    object
 9   star3                         554 non-null    object
 10  star2                         451 non-null    object
 11  star1                         328 non-null    object
 12  dimensions                    644 non-null    object
 13  weight                        651 non-null    object
 14  language                      759 non-null    object
 15  publisher                     714 non-null    object
 16  ISBN_13                       665 non-null    object
 17  link                          830 non-null    object
 18  complete_link                 830 non-null    object
dtypes: float64(2), object(17)
memory usage: 123.3+ KB

In [5]:
df.isnull().sum()

title                             0
author                          173
price                           108
price (including used books)    108
pages                            85
avg_reviews                     128
n_reviews                       128
star5                           128
star4                           195
star3                           276
star2                           379
star1                           502
dimensions                      186
weight                          179
language                         71
publisher                       116
ISBN_13                         165
link                              0
complete_link                     0
dtype: int64

In [6]:
#Check percentage of missing data
missing_data = df.isnull().sum() * 100/len(df)
percent_missing = pd.DataFrame({'Percent Missing' : missing_data})
percent_missing

                              Percent Missing
title                                0.000000
author                              20.843373
price                               13.012048
price (including used books)        13.012048
pages                               10.240964
avg_reviews                         15.421687
n_reviews                           15.421687
star5                               15.421687
star4                               23.493976
star3                               33.253012
star2                               45.662651
star1                               60.481928
dimensions                          22.409639
weight                              21.566265
language                             8.554217
publisher                           13.975904
ISBN_13                             19.879518
link                                 0.000000
complete_link                        0.000000

In [7]:
df.duplicated().sum()

0

### Check Object Variables

In [8]:
obj_variables = df.select_dtypes(object).sample(5)
obj_variables

,title,author,price (including used books),pages,n_reviews,star5,star4,star3,star2,star1,dimensions,weight,language,publisher,ISBN_13,link,complete_link
792,"Mastering PostgreSQL 13: Build, administer, an...",[ Hans-Jurgen Schonig],41.99,476,38,65%,12%,12%,8%,4%,7.5 x 1.08 x 9.25 inches,1.79 pounds,English,Packt Publishing; 4th ed. edition (November 13...,,/gp/slredirect/picassoRedirect.html/ref=pa_sp_...,https://www.amazon.com/gp/slredirect/picassoRe...
605,Continuous Delivery with Docker and Jenkins: C...,[ Rafal Leszko],46.99,350,80,60%,28%,10%,2%,NaN,7.5 x 0.79 x 9.25 inches,1.33 pounds,English,"Packt Publishing; 2nd edition (May 31, 2019)",978-1838552183,/gp/slredirect/picassoRedirect.html/ref=pa_sp_...,https://www.amazon.com/gp/slredirect/picassoRe...
709,Big Data Science in Finance,"[ Irene Aldridge, and , Marco Avellaneda]",67.41 - 75.83,336,11,56%,20%,12%,12%,NaN,7.3 x 1 x 10.2 inches,1.87 pounds,English,"Wiley; 1st edition (January 27, 2021)",,/Data-Science-Finance-Irene-Aldridge/dp/111960...,https://www.amazon.com/Data-Science-Finance-Ir...
264,Excel: The Complete Illustrative Guide for Beg...,[ Nigel Tillery],18.86,119,298,66%,20%,10%,3%,2%,8.5 x 0.27 x 11 inches,11.3 ounces,English,"Independently published (May 23, 2022)",979-8824373264,/gp/slredirect/picassoRedirect.html/ref=pa_sp_...,https://www.amazon.com/gp/slredirect/picassoRe...
768,Machine Learning Design Interview: Machine Lea...,[ Khang Pham],39.99,210,69,44%,14%,8%,9%,24%,6 x 0.48 x 9 inches,11.8 ounces,English,"Independently published (April 29, 2022)",979-8813031571,/Machine-Learning-Design-Interview-System/dp/B...,https://www.amazon.com/Machine-Learning-Design...

### STEPS TO TAKE

1. Replace missing values in pages with the average and clean the column

2. Rename the 'price (including used books)' column, replace NAN values with the average, and clean the column

3. Remove the ' [ ' and ' ] ' and any other characters from the author column and replace the missing values

4. Clean the n_reviews columns.

5. Clean the star columns

6. Convert the dimensions column to cm and replace null values with 0

7. convert all other units of measurements in the weight column with pounds and replace null values with 0

8. Split the rows in publisher column with date to another column and replace null values

9. Drop unnecessary columns 

10. Replace missing values in other columns.

### 1. Replace missing values in pages with the average and clean the column

In [9]:
df['pages'].sample(5)

276    168
524    454
731    316
774    NaN
670    360
348    134
398    149
263    332
72     129
775    NaN
Name: pages, dtype: object

The datatype for the pages column is object. Let's check to see why

In [10]:
# df['pages'].unique()

Some values are in string format so we'll convert them to a numeric type and fill them with 0

In [11]:
#Convert non-integer values to numeric
df['pages'] = pd.to_numeric(df['pages'], errors = 'coerce').fillna(0).astype(int)
df['pages']

0      500
1      484
2      274
3      547
4      368
      ...
825    208
826    573
827    288
828      0
829      0
Name: pages, Length: 830, dtype: int32

In [12]:
#Fill missing values with 0
df['pages'].fillna('0', inplace = True)
df['pages'].isnull().sum()

0

### 2. Rename the 'price (including used books)' column, clean the column, and replace NAN values with the average

In [13]:
df.rename(columns = {'price (including used books)':'all_prices'}, inplace = True)

In [14]:
df['all_prices']

0                 6.75
1       21.49 - 33.72
2                32.07
3                53.99
4                24.49
            ...
825      8.55 - 35.33
826     52.41 - 55.18
827              44.99
828                NaN
829              38.49
Name: all_prices, Length: 830, dtype: object

There are certain values in the all_prices column that reflect the costs of both new and used books. We'll calculate the average of these numbers

In [15]:
# Define a function to extract the minimum and maximum values from range values and compute their average
def price_average(val):
    if isinstance(val, str) and '-' in val:
        min_value, max_value = map(float, val.split('-'))
        return (min_value + max_value) / 2
    else:
        try:
            return float(val)
        except ValueError:
            return np.nan

# Apply the function to the column and create a new column
df['average_value'] = df['all_prices'].apply(price_average)

# Print the updated dataframe
df['average_value']

0       6.750
1      27.605
2      32.070
3      53.990
4      24.490
        ...
825    21.940
826    53.795
827    44.990
828       NaN
829    38.490
Name: average_value, Length: 830, dtype: float64

In [16]:
df['average_value'].fillna(df['average_value'].mean(), inplace = True)

In [17]:
#Round to 2 decimal places
np.round(df['average_value'], decimals=2)

0       6.75
1      27.60
2      32.07
3      53.99
4      24.49
       ...
825    21.94
826    53.80
827    44.99
828    43.06
829    38.49
Name: average_value, Length: 830, dtype: float64

### 3. Remove the ' [ ' and ' ] ' and any other characters from the author column and replace the missing values

In [19]:
df['author'].sample(10)

14                          [ Ekaterina Kochmar]
167                                          NaN
678                                          NaN
30                               [ Jonelle Hoop]
648        [ Jike Chong,  and , Yue Cathy Chang]
364           [ Gábor Békés,  and , Gábor Kézdi]
386                                          NaN
259    [ Rick J. Scavetta,  and , Boyan Angelov]
652                        [ Jonathan Schwabish]
332                   [ Cole Nussbaumer Knaflic]
Name: author, dtype: object

In [26]:
def author_col(x):
    if x == x:
        return x.lstrip('[ ').rstrip(']').replace(',  and ,', ' and')
    else:
        return x
    
df['author'] = df['author'].apply(author_col)

In [23]:
df['author'].sample(5)

227                    Joel Lawhead
671                       Dr. Briit
681                    Alex Gorelik
1                               NaN
190    Áine Humble and Elise Radina
Name: author, dtype: object

In [24]:
df['author'].fillna('No Name', inplace = True)

### 4. Clean the n_reviews column

In [28]:
df['n_reviews'].sample(10)

654    1,001
714       39
414      932
735      NaN
538      180
481        2
423        6
125       46
234      116
606      NaN
Name: n_reviews, dtype: object

All values in thousands have a comma. We'll remove the commas to make them integer values.

In [30]:
# replace commas in string values and leave NaN values as is
df['n_reviews'] = df['n_reviews'].apply(lambda x: str(x).replace(',', '') if type(x)==str else x)

In [31]:
#Convert to integer data type and replace null values with 0
df['n_reviews'] = pd.to_numeric(df['n_reviews'], errors = 'coerce').fillna(0).astype(int)
df['n_reviews']

0        23
1       124
2        10
3      1686
4        12
       ...
825      74
826      93
827       8
828       0
829     142
Name: n_reviews, Length: 830, dtype: int32

### 5. Clean the star column

Fill the null values in star columns with 0

In [32]:
df['star5'].fillna('0', inplace = True)
df['star4'].fillna('0', inplace = True)
df['star3'].fillna('0', inplace = True)
df['star2'].fillna('0', inplace = True)
df['star1'].fillna('0', inplace = True)

In [33]:
df[['star5', 'star4', 'star3', 'star2', 'star1']]

    star5 star4 star3 star2 star1
0     55%   39%    6%     0     0
1     61%   20%    9%    4%    6%
2     87%   13%     0     0     0
3     75%   16%    5%    2%    2%
4     52%   17%   10%   10%   10%
..    ...   ...   ...   ...   ...
825   72%   14%    7%    2%    4%
826   78%    7%    7%    4%    4%
827   83%   17%     0     0     0
828     0     0     0     0     0
829   79%   15%    4%    1%    1%

[830 rows x 5 columns]

In [34]:
#remove the percentage sign from the columns and convert it to a float, dividing by 100.
def strip_and_convert_to_float(df, column_name):
    df[column_name] = df[column_name].str.rstrip('%').astype(float) / 100

strip_and_convert_to_float(df, 'star5')
strip_and_convert_to_float(df, 'star4')
strip_and_convert_to_float(df, 'star3')
strip_and_convert_to_float(df, 'star2')
strip_and_convert_to_float(df, 'star1')

In [35]:
df[['star5', 'star4', 'star3', 'star2', 'star1']]

     star5  star4  star3  star2  star1
0     0.55   0.39   0.06   0.00   0.00
1     0.61   0.20   0.09   0.04   0.06
2     0.87   0.13   0.00   0.00   0.00
3     0.75   0.16   0.05   0.02   0.02
4     0.52   0.17   0.10   0.10   0.10
..     ...    ...    ...    ...    ...
825   0.72   0.14   0.07   0.02   0.04
826   0.78   0.07   0.07   0.04   0.04
827   0.83   0.17   0.00   0.00   0.00
828   0.00   0.00   0.00   0.00   0.00
829   0.79   0.15   0.04   0.01   0.01

[830 rows x 5 columns]

### 6. Convert the dimensions column to cm and replace null values with 0

In [37]:
df['dimensions'].sample(5)

369      9.17 x 1.42 x 7.6 inches
426    8.25 x 1.25 x 10.25 inches
577           6 x 0.55 x 9 inches
736      7.5 x 1.21 x 9.25 inches
649           7 x 1 x 9.25 inches
Name: dimensions, dtype: object

In [39]:
#Remove the inches unit of measurement
df['dimensions'] = df['dimensions'].str.rstrip('inches')
df['dimensions'].sample(5)

700    7.38 x 1.2 x 9.25
264      8.5 x 0.27 x 11
738                   NaN
455      8.5 x 0.78 x 11
43     7.5 x 1.42 x 9.25
Name: dimensions, dtype: object

In [40]:
# Define a function to convert inches to cm
def inch_to_cm(x):
    try:
        x = str(x)
        if 'x' in x:
            nums = [float(num.strip()) * 2.54 for num in x.split('x')]
            if len(nums) == 3:
                volume = nums[0] * nums[1] * nums[2] / 16.387
                return round(volume, 2)
            else:
                return sum(nums)
        else:
            return float(x) * 2.54
    except:
        return None

# Create a new column with the converted values
df['dimensions(cm)'] = df['dimensions'].apply(inch_to_cm)

df['dimensions(cm)']

0      94.44
1      72.52
2      53.21
3      71.41
4      56.66
       ...
825    32.90
826    70.69
827    45.09
828      NaN
829      NaN
Name: dimensions(cm), Length: 830, dtype: float64

In [42]:
df['dimensions(cm)'] = pd.to_numeric(df['dimensions(cm)'], errors = 'coerce').fillna(0).astype(float)

### 7. convert all other units of measurements in the weight column with pounds and replace null values with 0

In [43]:
#df['weight'].unique()

In [44]:
# define a function to convert ounces to pounds
def convert_to_pounds(val):
    if isinstance(val, str) and 'ounces' in val:
        ounces = float(val.split()[0])
        return ounces / 16
    elif isinstance(val, str) and 'pounds' in val:
            pounds = float(val.split()[0])
            return pounds
    else:
        return val

# apply the function to the 'Weight' column
df['weight'] = df['weight'].apply(convert_to_pounds)

df['weight']

0         2.53
1         1.96
2          1.4
3         1.47
4          1.3
        ...
825    0.96875
826       2.25
827        1.1
828        NaN
829        NaN
Name: weight, Length: 830, dtype: object

In [45]:
#Convert the column to numeric type and fill null values with 0.
df['weight'] = pd.to_numeric(df['weight'], errors = 'coerce').fillna(0).astype(float)

In [46]:
#Round to 2 decimal places
np.round(df['weight'], decimals=2)

0      2.53
1      1.96
2      1.40
3      1.47
4      1.30
       ...
825    0.97
826    2.25
827    1.10
828    0.00
829    0.00
Name: weight, Length: 830, dtype: float64

### 8. Split the rows in publisher column with date to another column and replace null values

In [47]:
df['publisher'].sample(5)

38        Mike Murach & Associates Inc (August 30, 2021)
818                                                  NaN
770                           Code Energy (July 2, 2021)
361                  Packt Publishing (January 20, 2022)
744    Auerbach Publications; 1st edition (May 13, 2022)
Name: publisher, dtype: object

In [48]:
# Split the "Publisher" column by the first opening parenthesis
df[['Publisher', 'Publication Date']] = df['publisher'].str.split('(', 1, expand=True)

# Extract the date and remove the closing parenthesis
df['Publication Date'] = df['Publication Date'].str.rstrip(')')

# convert Publication Date column to datetime format
df['Publication Date'] = pd.to_datetime(df['Publication Date'], errors='coerce')

df['Publication Date']

0     2021-11-22
1     2009-08-18
2     2022-08-01
3     2017-11-14
4     2022-02-03
         ...
825   2017-12-15
826   2020-07-02
827   2022-07-08
828          NaT
829          NaT
Name: Publication Date, Length: 830, dtype: datetime64[ns]

In [49]:
#Replace null values in publisher with 'No Name'
df['Publisher'].fillna('No Name', inplace = True)
df['Publisher']

0            Notion Press Media Pvt Ltd
1           O'Reilly Media; 1st edition
2      Holy Macro! Books; Third edition
3           O'Reilly Media; 2nd edition
4              For Dummies; 5th edition
                     ...
825               Corwin; First edition
826      Springer; 1st ed. 2020 edition
827                    Packt Publishing
828                              No Name
829                              No Name
Name: Publisher, Length: 830, dtype: object

### 9. Drop unnecessary columns

In [50]:
df.drop(['ISBN_13', 'link', 'complete_link', 'publisher', 'dimensions', 'all_prices'], axis = 1, inplace = True)

In [51]:
obj_var = df.select_dtypes(object).sample(5)
obj_var

,title,author,language,Publisher
36,Python for Data Science: A Hands-On Introduction,Yuli Vasiliev,English,No Starch Press
758,MongoDB Fundamentals: A hands-on guide to usin...,"Amit Phaltankar, Juned Ahsan, et al.",English,Packt Publishing
590,Learn to Code by Solving Problems: A Python Pr...,Daniel Zingaro,English,No Starch Press
747,Grokking Algorithms: An Illustrated Guide for ...,Aditya Bhargava,English,Manning; 1st edition
617,Python for Tweens and Teens - 2nd Edition (Bla...,Aristides Bouras,English,Independently published

In [52]:
df.isnull().sum()

title                 0
author                0
price               108
pages                 0
avg_reviews         128
n_reviews             0
star5                 0
star4                 0
star3                 0
star2                 0
star1                 0
weight                0
language             71
average_value         0
dimensions(cm)        0
Publisher             0
Publication Date    119
dtype: int64

### 10. Replace Missing values

In [53]:
#Fill missing values appropriately
df['avg_reviews'].fillna(df['avg_reviews'].mean(), inplace = True)
df['price'].fillna('0', inplace = True)
df['language'].fillna('No Language', inplace = True)